Revit 2026 API

# IFCLogical Enumeration

---

A datatype can have values TRUE, FALSE, UNKNOWN or UNSET.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum IFCLogical
```
```vb
Public Enumeration IFCLogical
```
```cpp
public enum class IFCLogical
```
```fsharp
type IFCLogical
```

| Member name | Value | Description |
| --- | --- | --- |
| False | 0 | False. |
| True | 2 | True. |
| Unknown | 1 | Unknown. |
| Unset | 3 | Unset. |

#### Reference

Autodesk.Revit.DB.IFC Namespace